### Lab 4 Exercise

Task 1: Write a Numpy program to test whether none of the elements of a given array is zero

In [6]:
import numpy as np

c= np.array([[1,2,3],[4,5,6]])
print(np.all(c))

True

Task 2: There are two arrays. The first array, array1 contains the values 45, 67, 23 and array2 
contains the values 56, 23, and 89. Write a Numpy program to create an element-wise comparison 
(greater, greater_equal, less and less_equal) of those two arrays.

In [5]:
x =[45,67,23]
y =[56,23,89]

print("Greater than: ", np.greater(x,y))
print("Greater Equal: ", np.greater_equal(x,y))
print("Less than: ", np.less(x,y))
print("Less equal: ", np.less_equal(x,y))

Greater than:  [False  True False]
Greater Equal:  [False  True False]
Less than:  [ True False  True]
Less equal:  [ True False  True]

Task3 Write a Numpy program to create an array of 8 zeros, 5 ones, 10 fives.

In [12]:
arr1 = np.zeros((0,8))
arr2 = np.ones((0,5))
arr3 =np.ones((0,10)) *5
arr = np.concatenate([arr1, arr2, arr3])
print(arr)

ValueError: all the input array dimensions except for the concatenation axis must match exactly, but along dimension 1, the array at index 0 has size 8 and the array at index 1 has size 5

In [13]:
import numpy as np

arr1 = np.zeros(8, dtype=int)       # 8 zeros
arr2 = np.ones(5, dtype=int)        # 5 ones
arr3 = np.ones(10, dtype=int) * 5   # 10 fives

arr = np.concatenate([arr1, arr2, arr3])
print(arr)

[0 0 0 0 0 0 0 0 1 1 1 1 1 5 5 5 5 5 5 5 5 5 5]

Task4: Write a Numpy program to add a vector v with values 2, 0, 2 to each row of a matrix m with 
values:
[23 45 11]
[12 23 54]
[29 19 34]
[1 23 10]

In [14]:
a = np.array([[23,45,11],[12,23,54],[29,19,34],[1,23,10]])
a = a + [2,0,2]
print(a)

[[25 45 13]
 [14 23 56]
 [31 19 36]
 [ 3 23 12]]

Task 5: Write a NumPy program to create a 5x5 2d array with 1 on the border and 25 inside.

In [16]:
a = np.ones((5,5))
a[2][2] =25
a

array([[ 1.,  1.,  1.,  1.,  1.],
       [ 1.,  1.,  1.,  1.,  1.],
       [ 1.,  1., 25.,  1.,  1.],
       [ 1.,  1.,  1.,  1.,  1.],
       [ 1.,  1.,  1.,  1.,  1.]])

Task 6: Write a NumPy program to find common values between two arrays.
Array1 Array2
[23, 45, 11, 5] [23, 5, 1]

In [19]:
b = np.array([23,45,11,5])
c = np.array([23,5,1])

print(np.intersect1d(b,c))

[ 5 23]

Task 7: Perform the following manipulation of the two arrays below: horizontal stacking, vertical 
stacking; divide the individual array horizontally and vertically.
Array1 Array2
[23, 45, 11]
[12, 23, 54]
[1, 23, 10]
[3, 5, 1]
[2, 3, 4]
[9, 1, 5

In [22]:
d = np.array([[23,45,11],[12,23,54],[1,23,10]])
e = np.array([[3,5,1],[2,3,4],[9,1,5]])

np.vstack((d,e))

array([[23, 45, 11],
       [12, 23, 54],
       [ 1, 23, 10],
       [ 3,  5,  1],
       [ 2,  3,  4],
       [ 9,  1,  5]])

In [23]:
np.hstack((d,e))

array([[23, 45, 11,  3,  5,  1],
       [12, 23, 54,  2,  3,  4],
       [ 1, 23, 10,  9,  1,  5]])

Consider the following dataframe for the remaining tasks
Sample DataFrame:

assessment_results = {'name': ['Anastasia', 'Paul', 'Kathe', 'Joseph', 'Linda', 'Michael', 'Matt', 
'Laurentine', 'Chirstian', 'Jonas'],

'score': [12.5, 10, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],

'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],

'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

Task 8: Write a Pandas program to get the first 3 rows of a given DataFrame

In [39]:
import pandas as pd
assessment_results = {'name': ['Anastasia', 'Paul', 'Kathe', 'Joseph', 'Linda', 'Michael', 'Matt', 
'Laurentine', 'Chirstian', 'Jonas'],
'score': [12.5, 10, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
frame =pd.DataFrame(assessment_results)
frame

         name  score  attempts qualify
0   Anastasia   12.5         1     yes
1        Paul   10.0         3      no
2       Kathe   16.5         2     yes
3      Joseph    NaN         3      no
4       Linda    9.0         2      no
5     Michael   20.0         3     yes
6        Matt   14.5         1     yes
7  Laurentine    NaN         1      no
8   Chirstian    8.0         2      no
9       Jonas   19.0         1     yes

In [26]:
frame[0:3]

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Paul   10.0         3      no
2      Kathe   16.5         2     yes

Task 9: Write a Pandas program to select the rows where the number of attempts in the 
examination is greater than 2

In [30]:
frame[frame['attempts']>2]

      name  score  attempts qualify
1     Paul   10.0         3      no
3   Joseph    NaN         3      no
5  Michael   20.0         3     yes

Task 10: Write a Pandas program to count the number of rows and columns of a DataFrame.

In [34]:
rows, cols = frame.shape
print(str(rows) +"rows")
print(str(cols) +"cols")

10rows
4cols

Task 11: Write a Pandas program to select the rows the score is between 14 and 20 (inclusive).

In [37]:
frame[(frame['score'] >= 14) & (frame['score'] <= 20)]

      name  score  attempts qualify
2    Kathe   16.5         2     yes
5  Michael   20.0         3     yes
6     Matt   14.5         1     yes
9    Jonas   19.0         1     yes

Task 12: Write a Pandas program to change the score in row 'c' to 11.5

In [51]:
labelframe = pd.DataFrame(labels,columns=['label'])
result = frame.join(labelframe)
result

         name  score  attempts qualify label
0   Anastasia   12.5         1     yes     a
1        Paul   10.0         3      no     b
2       Kathe   16.5         2     yes     c
3      Joseph    NaN         3      no     d
4       Linda    9.0         2      no     e
5     Michael   20.0         3     yes     f
6        Matt   14.5         1     yes     g
7  Laurentine    NaN         1      no     h
8   Chirstian    8.0         2      no     i
9       Jonas   19.0         1     yes     j

In [52]:
result.loc[result['label'] == 'c']

    name  score  attempts qualify label
2  Kathe   16.5         2     yes     c

In [53]:
# Update score where label is 'c'
result.loc[result['label'] == 'c', 'score'] = 11.5
result.loc[result['label'] == 'c']

    name  score  attempts qualify label
2  Kathe   11.5         2     yes     c

Task 13: Write a Pandas program to calculate the mean score for each different student in 
DataFrame

In [55]:
frame['score'].mean()

np.float64(13.6875)